Revit 2026 API

# MaterialCutBackgroundPatternColor Property

---

The color of the material cut background pattern.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public Color CutBackgroundPatternColor { get; set; }
```
```vb
Public Property CutBackgroundPatternColor As Color
	Get
	Set
```
```cpp
public:
property Color^ CutBackgroundPatternColor {
	Color^ get ();
	void set (Color^ value);
}
```
```fsharp
member CutBackgroundPatternColor : Color with get, set
```

#### Property Value

Color

| Exception | Condition |
| --- | --- |
| ArgumentNullException | When setting this property: A non-optional argument was null |

#### Reference

Material Class

Autodesk.Revit.DB Namespace